// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "Обновить прошивку";

// Errors
FileOpenError = "Невозможно открыть файл %@";
FileOpenErrorExplanation = "Данный файл либо поврежден, либо перемещен в другое место, переименован или удален. Проверьте местонахождение файла или выберите другой файл и повторите попытку.";
PrintChannelOpenError = "Не удается открыть канал принтера";
PrintChannelOpenErrorExplanation = "Убедитесь в том, что принтер подсоединен и включен, затем повторите попытку.";
SendDataError = "Не удается передать данные на принтер";
SendDataErrorExplanation = "Убедитесь в том, что принтер подсоединен и включен, затем повторите попытку.";

SomePenErrorTitle = "Не удается обновить прошивку";
DoorOpenMsg = "Невозможно обновить микропрограмму из-за открытой крышки. Закройте все крышки на принтере.";

// Aquamarine Errors
FileCheckError = "Не удается обновить прошивку";
FileCheckErrorExplanation = "Несоответствующий пакет прошивки. Выберите другой файл и повторите попытку.";

OkButton = "OK";
CancelButton = "Отмена";
FirmwareUpdateTitle = "Обновить прошивку";
FirmwareUpdateDeviceState = "Печать";
FirmwareUpdateCancelingDeviceState = "Отмена";

// Great Wall Messages
PrinterIdleWarning = "Если принтер занят (например, выполняется печать задания или калибровка), возможен сбой при обновлении прошивки.\r\rПрежде чем перейти к процедуре обновления прошивки принтера убедитесь в том, что принтер бездействует.";
UpdateSuccessful = "Файл прошивки успешно загружен, можно выполнять обновление принтера.\r\rПо окончании обновления принтера он будет автоматически перезагружен.";
InvalidPackage = "Возникли проблемы с файлом прошивки — процедура обновления прошивки не выполнена. Причиной возникновения проблемы могла быть ошибка передачи данных.\r\rПовторите попытку обновления прошивки.\rЕсли не удается устранить неполадку, обратитесь в службу технической поддержки HP.";
FailedDependencies = "Невозможно нормальное завершение процедуры обновления прошивки из-за проблемы с зависимостями.\r\rТекущая версиа прошивки %@, а вы пытаетесь установить %@.\r\rЗа требуемым пакетом обновления для данного принтера обратитесь на веб-страницу по адресу:\r%@.";
NotNow = "Обновление прошивки не выполнено — принтер занят (например, выполняется обработка или печать задания).\r\rУбедитесь в том, что принтер бездействует, и повторите обновление прошивки.";
TransmissionError = "Возникли неполадки с передачей данных, воспрепятствовавшие успешному обновлению прошивки.\r\rПроверьте соединения принтера и повторите обновление прошивки.";
LicenseNotAccepted = "Обновление прошивки не выполнено из-за отказа от принятия условий лицензии.";
FatalError = "Возникли неполадки, воспрепятствовавшие успешному завершению процедуры обновления прошивки.\r\rЕсли не удается устранить неполадку, обратитесь в службу технической поддержки HP.";

// layout
TaskTitle = "Обновить прошивку";
TaskDescription = "Выберите файл, содержащий обновление для прошивки принтера, и передайте этот файл на принтер для его обновления.";
FileNameTitle = "Имя файла:";
FileNameField = "<Не выбрано>";
ChooseButton = "Выберите…";
UpdateButton = "Обновить";
ProgressPanel = "Выполняется обновление…";
FirmwareUpdateProcessTitle = "Выполняется обновление…";
